<template>
  <div>
    <pre>
      语法介绍：
      [a-zA-Z0-9] 匹配选项列表
      * 匹配前面的子表达式零次或多次。要匹配 * 字符，请使用 \*。
      + 匹配前面的子表达式一次或多次。要匹配 + 字符，请使用 \+。
      ? 匹配前面的子表达式零次或一次，或指明一个非贪婪限定符。要匹配 ? 字符，请使用 \?
      {n} 匹配前面的子表达式n次
      {n,} 匹配前面的子表达式至少n次
      {n,m} 匹配前面的子表达式n次到m次

      常用表达式：
      手机号：/^1\d{10}$/
      邮箱：/^[a-zA-Z0-9_.-]+@[a-zA-Z0-9-]+(\.[a-zA-Z0-9-]+)*\.[a-zA-Z0-9]{2,6}$/
      汉字：/^[\u4e00-\u9fa5]{1,6}$/
      正整数：/^[1-9]\d*$/
      IP地址：/((?:(?:25[0-5]|2[0-4]\\d|[01]?\\d?\\d)\\.){3}(?:25[0-5]|2[0-4]\\d|[01]?\\d?\\d))/
      网址：/(((^https?:(?:\/\/)?)(?:[-;:&=\+\$,\w]+@)?[A-Za-z0-9.-]+(?::\d+)?|(?:www.|[-;:&=\+\$,\w]+@)[A-Za-z0-9.-]+)((?:\/[\+~%\/.\w-_]*)?\??(?:[-\+=&;%@.\w_]*)#?(?:[\w]*))?)$/
      邮编：/[1-9]\d{5}(?!\d)/</pre>
  </div>
</template>
